ССЫЛКА НА ИСТОЧНИК ЗАДАЧ: https://leetcode.com/studyplan/top-sql-50/

# <b>SELECT</b>

1757.Recyclable and Low Fat Products

Write a solution to find the ids of products that are both low fat and recyclable.

In [ ]:
SELECT product_id
FROM Products
WHERE low_fats = 'Y'
AND recyclable = 'Y'

584.Find Customer Referee

Find the names of the customer that are not referred by the customer with id = 2.

In [ ]:
SELECT name
FROM Customer
WHERE referee_id IS NULL
OR referee_id != 2

595.Big Countries

Write a solution to find the name, population, and area of the big countries.

In [ ]:
SELECT name,
       population,
       area
FROM World
WHERE area >= 3000000
OR population >= 25000000

1148.Article Views I

Write a solution to find all the authors that viewed at least one of their own articles.

In [ ]:
SELECT DISTINCT author_id as id
FROM Views
WHERE author_id = viewer_id
ORDER BY id

683.Invalid Tweets

Write a solution to find the IDs of the invalid tweets. The tweet is invalid if the number of characters used in the content of the tweet is strictly greater than 15.

In [ ]:
SELECT tweet_id
FROM Tweets
WHERE LENGTH(content) > 15

## <b>BASIC JOINS</b>

1378.Replace Employee ID With The Unique Identifier

Write a solution to show the unique ID of each user, If a user does not have a unique ID replace just show null.

In [ ]:
SELECT unique_id,
        name
FROM Employees
LEFT JOIN EmployeeUNI USING(id)

1068.Product Sales Analysis I

Write a solution to report the product_name, year, and price for each sale_id in the Sales table.

In [ ]:
SELECT product_name,
       year,
       price
FROM Sales
JOIN Product USING(product_id)

1581.Customer Who Visited but Did Not Make Any Transactions

Write a solution to find the IDs of the users who visited without making any transactions and the number of times they made these types of visits.

In [ ]:
SELECT customer_id,
       COUNT(*) as count_no_trans
FROM Visits
LEFT JOIN Transactions USING(visit_id)
WHERE transaction_id IS NULL
GROUP BY customer_id

197.Rising Temperature

Write a solution to find all dates' Id with higher temperatures compared to its previous dates (yesterday).

In [ ]:
SELECT w1.id
FROM Weather as w1
JOIN Weather as w2 ON DATEDIFF(w1.recordDate, w2.recordDate) = 1
WHERE w1.temperature > w2.temperature

1661.Average Time of Process per Machine

The resulting table should have the machine_id along with the average time as processing_time, which should be rounded to 3 decimal places.

In [ ]:
SELECT a1.machine_id,
       ROUND(AVG(a2.timestamp - a1.timestamp), 3) as processing_time
FROM Activity as a1
JOIN Activity as a2 USING(machine_id)
WHERE a1.activity_type ='start'
AND a2.activity_type = 'end'
GROUP BY machine_id

577.Employee Bonus

Write a solution to report the name and bonus amount of each employee with a bonus less than 1000.

In [ ]:
SELECT name,
       bonus
FROM Employee
LEFT JOIN Bonus using(empId)
WHERE bonus < 1000
OR bonus is null

1280.Students and Examinations

Write a solution to find the number of times each student attended each exam.

In [ ]:
SELECT
    s.student_id,
    s.student_name,
    u.subject_name,
    COUNT(e.subject_name) AS attended_exams
FROM Students ass
CROSS JOIN as Subjects u
LEFT JOIN Examinations e
ON s.student_id = e.student_id AND u.subject_name = e.subject_name
GROUP BY s.student_id, s.student_name, u.subject_name
ORDER BY s.student_id, u.subject_name

570.Managers with at Least 5 Direct Reports

Write a solution to find managers with at least five direct reports.

In [ ]:
SELECT e2.name
FROM Employee as e1
JOIN Employee as e2 on e1.managerId = e2.id
GROUP BY e1.managerId
HAVING COUNT(e1.id) >= 5

1934.Confirmation Rate

Write a solution to find the confirmation rate of each user.

In [ ]:
SELECT user_id,
       ROUND(AVG(CASE WHEN action = 'confirmed'  THEN 1 ELSE 0 END), 2) as confirmation_rate
FROM Signups
LEFT JOIN Confirmations USING(user_id)
GROUP BY user_id

## <b>BASIC AGGREGATE FUNCTIONS</b>

620.Not Boring Movies

Write a solution to report the movies with an odd-numbered ID and a description that is not "boring".

In [ ]:
SELECT *
FROM Cinema
WHERE description != 'boring'
AND id % 2 != 0
ORDER BY rating DESC

1251.Average Selling Price

Write a solution to find the average selling price for each product. average_price should be rounded to 2 decimal places.

In [ ]:
SELECT p.product_id,
       IFNULL(ROUND(SUM(price * units) / SUM(units), 2), 0) as average_price
FROM Prices as p
LEFT JOIN UnitsSold as u
ON p.product_id = u.product_id AND
u.purchase_date BETWEEN start_date AND end_date
GROUP BY p.product_id

1075.Project Employees I

Write an SQL query that reports the average experience years of all the employees for each project, rounded to 2 digits.

In [ ]:
SELECT project_id,
       ROUND(AVG(experience_years), 2) as average_years
FROM Project
LEFT JOIN Employee using(employee_id)
GROUP BY project_id

1633.Percentage of Users Attended a Contest

Write a solution to find the percentage of the users registered in each contest rounded to two decimals.

In [ ]:
SELECT contest_id,
       ROUND(COUNT(user_id) * 100 / (SELECT COUNT(user_id) FROM Users), 2) as percentage
FROM Register
GROUP BY contest_id
GROUP BY percentage DESC, contest_id

1211.Queries Quality and Percentage

Write a solution to find each query_name, the quality and poor_query_percentage.

In [ ]:
SELECT query_name,
       ROUND(AVG((rating) / position), 2) as quality,
       ROUND(AVG(CASE WHEN rating < 3 THEN 1 ELSE 0 END) * 100, 2) as poor_query_percentage
FROM Queries
GROUP BY query_name

1193.Monthly Transactions I

Write an SQL query to find for each month and country, the number of transactions and their total amount, the number of approved transactions and their total amount.

In [ ]:
SELECT DATE_FORMAT(trans_date, '%Y-%m') as month,
       country,
       COUNT(id) as trans_count,
       SUM(CASE WHEN state ='approved' THEN 1 ELSE 0 END) approved_count,
       SUM(amount) as trans_total_amount,
       SUM(CASE WHEN state='approved' THEN amount ELSE 0 END) approved_total_amount
FROM Transactions
GROUP BY month, country

1174.Immediate Food Delivery II

Write a solution to find the percentage of immediate orders in the first orders of all customers, rounded to 2 decimal places.

In [ ]:
SELECT ROUND(COUNT(*) / (SELECT COUNT(DISTINCT customer_id) FROM Delivery) * 100, 2) as immediate_percentage
FROM (SELECT customer_id
      FROM Delivery
      GROUP BY customer_id
      HAVING MIN(order_date) = MIN(customer_pref_delivery_date)) as t1

550.Game Play Analysis IV

Write a solution to report the fraction of players that logged in again on the day after the day they first logged in, rounded to 2 decimal places. I

In [ ]:
SELECT ROUND(SUM(login)/COUNT(DISTINCT player_id), 2) AS fraction
FROM (
  SELECT
    player_id,
    DATEDIFF(event_date, MIN(event_date) OVER(PARTITION BY player_id)) = 1 AS login
  FROM Activity
) AS t1

## <b>SORTING AND GROUPING</b>

2356.Number of Unique Subjects Taught by Each Teacher

Write a solution to calculate the number of unique subjects each teacher teaches in the university.

In [ ]:
SELECT teacher_id,
       COUNT(DISTINCT subject_id) as cnt
FROM Teacher
GROUP BY teacher_id

1141.User Activity for the Past 30 Days I

Write a solution to find the daily active user count for a period of 30 days ending 2019-07-27 inclusively. A user was active on someday if they made at least one activity on that day.

In [ ]:
SELECT activity_date as day,
       COUNT(DISTINCT user_id) as active_users
FROM Activity
WHERE activity_date BETWEEN '2019-06-28' AND '2019-07-27'
GROUP BY day

1070.Product Sales Analysis III

Write a solution to select the product id, year, quantity, and price for the first year of every product sold.

In [ ]:
SELECT product_id,
       year as first_year,
       quantity,
      price
FROM Sales
WHERE(product_id, year) IN (SELECT product_id,
                                   min(year)
                            FROM Sales
                            GROUP BY product_id)

596.Classes More Than 5 Students

Write a solution to find all the classes that have at least five students.

In [ ]:
SELECT class
FROM courses
GROUP BY class
HAVING count(student) >= 5

1729.Find Followers Count

Write a solution that will, for each user, return the number of followers.

In [ ]:
SELECT user_id,
       count(follower_id) as followers_count
FROM Followers
GROUP BY user_id
ORDER BY user_id

619.Biggest Single Number

A single number is a number that appeared only once in the MyNumbers table.

Find the largest single number. If there is no single number, report null.

In [ ]:
SELECT max(num) as num
FROM(SELECT num
     FROM MyNumbers
     GROUP BY num
     HAVING count(num) = 1) as t1

1045.Customers Who Bought All Products

Write a solution to report the customer ids from the Customer table that bought all the products in the Product table.

In [ ]:
SELECT customer_id
FROM Customer
GROUP BY customer_id
HAVING COUNT(DISTINCT product_key) = (SELECT COUNT(*) FROM Product)

##<b>ADVANCED SELECT AND JOINS</b>

1731.The Number of Employees Which Report to Each Employee

Write a solution to report the ids and the names of all managers, the number of employees who report directly to them, and the average age of the reports rounded to the nearest integer.

In [ ]:
SELECT t1.employee_id,
       t1.name,
       COUNT(*) as reports_count,
       ROUND(AVG(t2.age)) as average_age
FROM Employees as t1
JOIN Employees t2 ON t1.employee_id = t2.reports_to
GROUP BY employee_id
ORDER BY employee_id

1789.Primary Department for Each Employee

Write a solution to report all the employees with their primary department. For employees who belong to one department, report their only department.

In [ ]:
SELECT employee_id,
        department_id
FROM Employee
WHERE primary_flag = 'Y'
OR employee_id IN (SELECT employee_id
                   FROM Employee
                   GROUP BY employee_id
                   HAVING COUNT(employee_id) = 1)
GROUP BY employee_id

610.Triangle Judgement

Report for every three line segments whether they can form a triangle.

In [ ]:
SELECT x,
       y,
       z,
       CASE
       WHEN x + y > z AND x + z > y AND y + z > x THEN 'Yes'
       ELSE 'No'
       END as Triangle
FROM Triangle

180.Consecutive Numbers

Find all numbers that appear at least three times consecutively.

In [ ]:
SELECT DISTINCT num as ConsecutiveNums
FROM Logs
WHERE (id + 1, num) IN (SELECT *
                        FROM Logs)
AND (id + 2, num) IN (SELECT *
                      FROM Logs)

1164.Product Price at a Given Date

Write a solution to find the prices of all products on 2019-08-16. Assume the price of all products before any change is 10.

In [ ]:
WITH t1 AS(
SELECT product_id,
       COALESCE(new_price, 10) as price
FROM Products
WHERE (product_id, change_date) IN (SELECT product_id,
                                           MAX(change_date)
                                    FROM Products
                                    WHERE change_date <= '2019-08-16'
                                    GROUP BY product_id))
SELECT DISTINCT p.product_id,
                COALESCE(price, 10) as price
FROM Products p
LEFT JOIN t1 USING(product_id)

1204.Last Person to Fit in the Bus

Write a solution to find the person_name of the last person that can fit on the bus without exceeding the weight limit. The test cases are generated such that the first person does not exceed the weight limit.

In [ ]:
WITH t1 AS (
SELECT turn,
       person_name,
       weight,
       SUM(weight) OVER(ORDER BY turn ASC) AS tot_weight
FROM Queue
ORDER BY turn)

SELECT person_name
FROM Queue
WHERE turn = (SELECT MAX(turn) FROM t1 WHERE tot_weight <= 1000)

1907.Count Salary Categories

Write a solution to calculate the number of bank accounts for each salary category.

In [ ]:
SELECT 'Low Salary' as category,
        SUM(CASE WHEN income < 20000 THEN 1 ELSE 0 END) as accounts_count
FROM Accounts
UNION
SELECT 'Average Salary',
        SUM(CASE WHEN income >=20000 AND income <=50000 THEN 1 ELSE 0 END) as accounts_count
FROM Accounts
UNION
SELECT 'High Salary',
        SUM(CASE WHEN income >50000 THEN 1 ELSE 0 END) as accounts_count
FROM Accounts

#<b>SUBQUERIES</b>

1978.Employees Whose Manager Left the Company

Find the IDs of the employees whose salary is strictly less than $30000 and whose manager left the company. When a manager leaves the company, their information is deleted from the Employees table, but the reports still have their manager_id set to the manager that left.

In [ ]:
SELECT employee_id
FROM Employees
WHERE salary < 30000
AND manager_id NOT IN (
    SELECT DISTINCT(employee_id) FROM Employees
)
ORDER BY employee_id

626.Exchange Seats

Write a solution to swap the seat id of every two consecutive students. If the number of students is odd, the id of the last student is not swapped.

In [ ]:
SELECT
    CASE
        WHEN id=(SELECT MAX(id) FROM seat) AND id%2 != 0 THEN id
        WHEN id%2 = 0 THEN id-1
        WHEN id%2 != 0 THEN id+1
    END as id,
    student
FROM seat
ORDER BY id

1341.Movie Rating

Write a solution to:

Find the name of the user who has rated the greatest number of movies. In case of a tie, return the lexicographically smaller user name.
Find the movie name with the highest average rating in February 2020. In case of a tie, return the lexicographically smaller movie name.

In [ ]:
(
  SELECT name AS results
  FROM MovieRating
  LEFT JOIN Users USING(user_id)
  GROUP BY user_id, name
  ORDER BY COUNT(*) DESC, name
  LIMIT 1
)
UNION ALL
(
  SELECT title
  FROM MovieRating
  LEFT JOIN Movies USING(movie_id)
  WHERE MONTH(created_at) = 2 AND YEAR(created_at) = 2020
  GROUP BY movie_id
  ORDER BY AVG(rating) DESC, title
  LIMIT 1
)

1321.Restaurant Growth

Compute the moving average of how much the customer paid in a seven days window (i.e., current day + 6 days before). average_amount should be rounded to two decimal places.

In [ ]:
SELECT visited_on,
       amount,
       ROUND(amount/7, 2) as average_amount
FROM (SELECT distinct visited_on,
             SUM(amount) OVER(ORDER BY visited_on RANGE BETWEEN INTERVAL 6 DAY PRECEDING AND CURRENT ROW) as amount,
             MIN(visited_on) OVER() as min_data
      FROM Customer) as t1
WHERE visited_on >= (min_data + 6)

602.Friend Requests II: Who Has the Most Friends

Write a solution to find the people who have the most friends and the most friends number.

In [ ]:
SELECT id,
       count(*) as num
FROM
((SELECT requester_id as id
  FROM RequestAccepted)
  UNION ALL
  (SELECT accepter_id as id
   FROM RequestAccepted)
) as t1
GROUP BY id
ORDER BY num DESC
LIMIT 1

585.Investments in 2016

Write a solution to report the sum of all total investment values in 2016 tiv_2016, for all policyholders who:

In [ ]:
SELECT ROUND(SUM(tiv_2016), 2) as tiv_2016
FROM Insurance
WHERE tiv_2015 IN (SELECT tiv_2015
                   FROM insurance
                   GROUP BY tiv_2015
                   HAVING count(pid) > 1)
AND (lat, lon) IN (SELECT lat, lon
                   FROM Insurance
                   GROUP BY lat, lon
                   HAVING count(pid) = 1)